{
  "hazard": "Driving a vehicle on a highway",
  "hazard_description": "Operating a vehicle at highway speeds introduces significant dynamic risk due to speed, traffic density, and environmental factors.",
  "top_event": "Loss of control over the vehicle",
  "top_event_description": "The driver is no longer able to keep the vehicle in a safe state, resulting in a hazardous situation.",
  "threats": [
    {
      "id": "t1",
      "name": "Intoxicated driving",
      "description": "Operator impairment due to alcohol or drugs can lead to delayed reactions and poor decision-making."
    },
    {
      "id": "t2",
      "name": "Speeding",
      "description": "Operating the vehicle above safe speeds reduces reaction time and increases stopping distance."
    },
    {
      "id": "t3",
      "name": "Distracted driving",
      "description": "Mobile device use, eating, or other distractions reduce awareness of roadway conditions."
    }
  ],
  "prevention_barriers": [
    {
      "id": "pb1",
      "name": "Designated driver",
      "description": "Assign a sober driver to eliminate impairment risk before departure."
    },
    {
      "id": "pb2",
      "name": "Lane departure warning",
      "description": "Assistive technology alerts the driver when the vehicle begins to leave its lane."
    },
    {
      "id": "pb3",
      "name": "Speed governance",
      "description": "Limit vehicle top speed via hardware or telematics policies to reduce speeding risk."
    }
  ],
  "mitigation_barriers": [
    {
      "id": "mb1",
      "name": "Seatbelt use",
      "description": "Occupants wearing seatbelts reduce the severity of injuries during a collision."
    },
    {
      "id": "mb2",
      "name": "Defensive driving training",
      "description": "Training equips drivers to respond safely to loss-of-control scenarios."
    },
    {
      "id": "mb3",
      "name": "Automatic emergency braking",
      "description": "Sensors detect imminent collisions and apply the brakes to stay below injury thresholds."
    }
  ],
  "consequences": [
    {
      "id": "c1",
      "name": "Injury or death",
      "description": "Occupants and other road users may suffer serious harm."
    },
    {
      "id": "c2",
      "name": "Vehicle damage",
      "description": "Loss of control can result in significant damage to the vehicle and property."
    },
    {
      "id": "c3",
      "name": "Traffic disruption",
      "description": "Incidents can close lanes and create congestion for other motorists."
    }
  ]
}


